#+TITLE: OrgMode Notes
#+OPTIONS: H:4 ^:nil toc:nil

** Column group
   When Org exports tables, it does so by default without vertical lines
   because that is visually more satisfying in general.  Occasionally
   however, vertical lines can be useful to structure a table into groups
   of columns, much like horizontal lines can do for groups of rows.  In
   order to specify column groups, you can use a special row where the
   first field contains only `/'.  The further fields can either contain
   `<' to indicate that this column should start a group, `>' to indicate
   the end of a column, or `<>' (no space between `<' and `>') to make a
   column a group of its own.  Boundaries between column groups will upon
   export be marked with vertical lines.  Here is an example:

   #+BEGIN_SRC orgmode
| N | N^2 | N^3 | N^4 | ~sqrt(n)~ | ~sqrt[4](N)~ |
|---+-----+-----+-----+-----------+--------------|
| / |   < |     |   > |         < |            > |
| 1 |   1 |   1 |   1 |         1 |            1 |
| 2 |   4 |   8 |  16 |    1.4142 |       1.1892 |
| 3 |   9 |  27 |  81 |    1.7321 |       1.3161 |
|---+-----+-----+-----+-----------+--------------|
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
   #+END_SRC

   It is also sufficient to just insert the column group starters after
   every vertical line you would like to have:

   #+BEGIN_SRC orgmode
|  N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|----+-----+-----+-----+---------+------------|
| /  | <   |     |     | <       |            |
   #+END_SRC

